espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/src/py32f07x_hal_can.c
/**
  ******************************************************************************
  * @file    py32f07x_hal_can.c
  * @author  MCU Application Team
  * @brief   CAN HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CAN with Flexible Data-rate (CAN).
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions
  * @attention
  ******************************************************************************
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "py32f07x_hal.h"

#ifdef  HAL_CAN_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private defines ------------------------------------------------------------*/
#define CAN_TIMEOUT_VALUE 10U
#define CAN_LLC_EXTENDED_ID_MSK              (0x1FFFFFFFU)
#define CAN_LLC_STANDARD_ID_MSK              (0x7FF<<18)
#define CAN_LLC_FORMAT_MSK                   (0x1F1707FF)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static const uint8_t DLCtoBytes[] = {0, 1, 2, 3, 4, 5, 6, 7, 8};

/* Private function prototypes -----------------------------------------------*/
/** @addtogroup CAN_Private_Functions_Prototypes
  * @{
  */
static void CAN_CopyMessageToFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData);
/**
  * @}
  */

/**
  * @brief  CAN init
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_Init(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

  /* Check CAN handle */
  if (hcan == NULL)
  {
    return HAL_ERROR;
  }

  /* Check function parameters */
  assert_param(IS_CAN_ALL_INSTANCE(hcan->Instance));
  assert_param(IS_CAN_FRAME_FORMAT(hcan->Init.FrameFormat));
  assert_param(IS_CAN_MODE(hcan->Init.Mode));
  assert_param(IS_CAN_CKDIV(hcan->Init.Prescaler));
  assert_param(IS_CAN_NOMINAL_SJW(hcan->Init.NominalSyncJumpWidth));
  assert_param(IS_CAN_NOMINAL_TSEG1(hcan->Init.NominalTimeSeg1));
  assert_param(IS_CAN_NOMINAL_TSEG2(hcan->Init.NominalTimeSeg2));

  if (hcan->State == HAL_CAN_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hcan->Lock = HAL_UNLOCKED;

    /* Init the low level hardware: CLOCK, NVIC */
    HAL_CAN_MspInit(hcan);
  }

  /* forces to reset state */
  SET_BIT(hcan->Instance->MCR, CAN_MCR_RESET);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait until the RESET bit into MCR register is set */
  while ((hcan->Instance->MCR & CAN_MCR_RESET) == 0U)
  {
    /* Check for the Timeout */
    if ((HAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
    {
      /* Update error code */
      hcan->ErrorCode |= HAL_CAN_ERROR_TIMEOUT;

      /* Change CAN state */
      hcan->State = HAL_CAN_STATE_ERROR;

      return HAL_ERROR;
    }
  }

  /* Specifies the number of time quanta in Bit */  
  hcan->Instance->ACBTR = (((hcan->Init.NominalSyncJumpWidth - 1U) << CAN_ACBTR_AC_SJW_Pos) + \
                             ((hcan->Init.NominalTimeSeg1 - 2U) << CAN_ACBTR_AC_SEG_1_Pos) + \
                             ((hcan->Init.NominalTimeSeg2 - 1U) << CAN_ACBTR_AC_SEG_2_Pos));
  
  MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_PRESC, ((hcan->Init.Prescaler - 1U) << CAN_RLSSP_PRESC_Pos));

  /* Initialize the error code */
  hcan->ErrorCode = HAL_CAN_ERROR_NONE;

  /* Initialize the CAN state */
  hcan->State = HAL_CAN_STATE_READY;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Config CAN filter
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  sFilter pointer to an CAN_FilterTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigFilter(CAN_HandleTypeDef *hcan, CAN_FilterTypeDef *sFilter)
{
  HAL_CAN_StateTypeDef state = hcan->State;

  /* Check function parameters */
  assert_param(IS_CAN_ID_TYPE(sFilter->IdType));
  assert_param(IS_CAN_FILTER_CHANNEL(sFilter->FilterChannel));
  assert_param(IS_CAN_RANK(sFilter->Rank));
  assert_param(IS_CAN_FILTER_ID(sFilter->FilterID));
  assert_param(IS_CAN_FILTER_FORMAT(sFilter->FilterFormat));
  assert_param(IS_CAN_MASK_ID(sFilter->MaskID));
  assert_param(IS_CAN_MASK_FORMAT(sFilter->MaskFormat));
  
  if (state == HAL_CAN_STATE_READY)
  {
    if (sFilter->Rank == CAN_FILTER_RANK_NONE)
    {
      /* Disable Filter channel */
      CLEAR_BIT(hcan->Instance->ACFCR, (1U << (CAN_ACFCR_AE_0_Pos + sFilter->FilterChannel)));
    }
    else
    {
      /* Specify acceptance filter address */
      MODIFY_REG(hcan->Instance->ACFCR, CAN_ACFCR_ACFADR, sFilter->FilterChannel);

      /* Specify acceptance code Identifier and mask Identifier */
      if (sFilter->IdType == CAN_STANDARD_ID)
      {
        hcan->Instance->ACFC.ID = sFilter->FilterID << 18;
        hcan->Instance->ACFM.ID = (~CAN_LLC_STANDARD_ID_MSK) | (sFilter->MaskID << 18);
      }
      else
      {
        hcan->Instance->ACFC.ID = sFilter->FilterID;
        hcan->Instance->ACFM.ID = (~CAN_LLC_EXTENDED_ID_MSK) | (sFilter->MaskID);
      }

