espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/src/py32f07x_hal_can.c
      /* Specify acceptance code Format */
      hcan->Instance->ACFC.FORMAT = sFilter->FilterFormat;

      /* Specify acceptance mask Format */
      hcan->Instance->ACFM.FORMAT = (~CAN_LLC_FORMAT_MSK) | (sFilter->MaskFormat);

      /* Specify acceptance mask Type */
      hcan->Instance->ACFM.TYPE = 0xFFFFFFFF;

      /* Specify acceptance mask Acceptance Field */
       hcan->Instance->ACFM.RESERVED1 = 0xFFFFFFFF;
      /* Enable Filter channel*/
      SET_BIT(hcan->Instance->ACFCR, (1U << (CAN_ACFCR_AE_0_Pos + sFilter->FilterChannel)));
    }

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_INITIALIZED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Copy message to transmit FIFO
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pTxHeader pointer to an CAN_TxHeaderTypeDef structure.
  * @param  pTxHeader pointer to a buffer containing the payload of the Tx frame.
  * @retval HAL status
  */
static void CAN_CopyMessageToFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData)
{
  uint32_t index;
  uint32_t ByteCounter;
  
  /* Specify TBUF Identifier */
  if (pTxHeader->IdType == CAN_STANDARD_ID)
  {
    hcan->Instance->TBUF.ID = pTxHeader->Identifier << 18;
  }
  else
  {
    hcan->Instance->TBUF.ID = pTxHeader->Identifier;
  }

  /* Specify TBUF FORMAT */
  hcan->Instance->TBUF.FORMAT = pTxHeader->DataLength | pTxHeader->IdType | pTxHeader->FrameFormat | pTxHeader->TxFrameType;

  /* Specify TBUF HANDLE */
  hcan->Instance->TBUF.TYPE = pTxHeader->Handle << 24;
  
  /* Write Tx payload to the message RAM */
  index = 0;
  for (ByteCounter = 0; ByteCounter < DLCtoBytes[pTxHeader->DataLength]; ByteCounter += 4U)
  {
    hcan->Instance->TBUF.DATA[index++] = (((uint32_t)pTxData[ByteCounter + 3U] << 24U) |
                                           ((uint32_t)pTxData[ByteCounter + 2U] << 16U)  |
                                           ((uint32_t)pTxData[ByteCounter + 1U] << 8U)   |
                                            (uint32_t)pTxData[ByteCounter]);
  }
}

/**
  * @brief  Add a message to the Tx FIFO
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pTxheader pointer to an CAN_TxHeaderTypeDef structure.
  * @param  pData pointer to a buffer containing the payload of the Tx frame.
  * @param  TxFifoType Tx FIFO type.
  *         This parameter can be a value of @arg CAN_fifo_type.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_AddMessageToTxFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *pTxHeader, uint8_t *pData, uint32_t TxFifoType)
{
  /* Check function parameters */
  assert_param(IS_CAN_ID_TYPE(pTxHeader->IdType));
  if (pTxHeader->IdType == CAN_STANDARD_ID)
  {
    assert_param(IS_CAN_MAX_VALUE(pTxHeader->Identifier, 0x7FFU));
  }
  else /* pTxHeader->IdType == CAN_EXTENDED_ID */
  {
    assert_param(IS_CAN_MAX_VALUE(pTxHeader->Identifier, 0x1FFFFFFFU));
  }
  assert_param(IS_CAN_TX_FRAME_TYPE(pTxHeader->TxFrameType));
  assert_param(IS_CAN_FRAME_FORMAT(pTxHeader->FrameFormat));
  assert_param(IS_CAN_Handle(pTxHeader->Handle));
  assert_param(IS_CAN_DLC(pTxHeader->DataLength));
  assert_param(IS_CAN_TX_FIFO_TYPE(TxFifoType));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (TxFifoType == CAN_TX_FIFO_PTB)
    {
      /* select PTB FIFO */
      CLEAR_BIT(hcan->Instance->MCR, CAN_MCR_TBSEL);

      /* check that the PTB FIFO is not full */
      if (READ_BIT(hcan->Instance->MCR, CAN_MCR_TPE) == 0)
      {
        /* Write data to the FIFO */
        CAN_CopyMessageToFifo(hcan, pTxHeader, pData);
      }
      else
      {
        /* Update error code */
        hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

        /* The PTB is transmitting data, Cannot write data to PTB FIFO */
        return HAL_ERROR;
      }
    }
    else
    {
      /* select STB FIFO */
      SET_BIT(hcan->Instance->MCR, CAN_MCR_TBSEL);

      /* check that the STB FIFO is not full */
      if (__HAL_CAN_GET_STB_FIFO_FREE_LEVEL(hcan) != CAN_STB_FIFO_FULL)
      {
        /* Write data to the FIFO */
        CAN_CopyMessageToFifo(hcan, pTxHeader, pData);
        
        /* this slot has been filled, CAN-CTRL connects the TBUF registers to the next slot.*/
        SET_BIT(hcan->Instance->MCR, CAN_MCR_TSNEXT);
      }
      else
      {
        /* Update error code */
        hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

        /* The STB FIFO is full and cannot be written */
        return HAL_ERROR;
      }
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Activation the message is sent from Tx FIFO to the bus
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  activeTxMode Select the sending mode
  *         This parameter can be a value of @arg CAN_transmit_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ActivateTxRequest(CAN_HandleTypeDef *hcan, uint32_t activeTxMode)
{
  /* Check function parameters */
  assert_param(IS_CAN_TRANSMIT_MODE(activeTxMode));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (activeTxMode == CAN_TXFIFO_PTB_SEND)
    {
      /* PTB FIFO data start sending */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TPE);
    }

    if (activeTxMode == CAN_TXFIFO_STB_SEND_ONE)
    {
      /* Transmit STB FIFO one frame */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSONE);

      hcan->LastSTBTxType = CAN_TXFIFO_STB_SEND_ONE;
    }
    else if (activeTxMode == CAN_TXFIFO_STB_SEND_ALL)
    {
      /* Transmit STB FIFO all frame */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSALL);

      hcan->LastSTBTxType = CAN_TXFIFO_STB_SEND_ALL;
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Get Tx FIFO message
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pRxHeader pointer to an CAN_RxHeaderTypeDef structure.
  * @param  pRxData pointer to a buffer containing the payload of the Rx frame.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_GetRxMessage(CAN_HandleTypeDef *hcan, CAN_RxHeaderTypeDef *pRxHeader, uint8_t *pRxData)
{
  uint8_t  *pData;
  uint32_t ByteCounter;
  uint32_t Format;
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (__HAL_CAN_GET_RX_FIFO_FILL_LEVEL(hcan) == CAN_RX_FIFO_EMPTY)
    {
      /* Update error code */
      hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

      return HAL_ERROR;
    }

    Format = hcan->Instance->RBUF.FORMAT;
    pRxHeader->DataLength = Format & CAN_LLC_FORMAT_DLC;
    pRxHeader->IdType = Format & CAN_LLC_FORMAT_IDE;
    pRxHeader->RxFrameType = Format & CAN_LLC_FORMAT_RMF;
		pRxHeader->FrameFormat = Format & CAN_LLC_FORMAT_FDF;
    pRxHeader->ProtocolErrorType = (Format & CAN_LLC_FORMAT_KOER)>>CAN_LLC_FORMAT_KOER_Pos;
    pRxHeader->LoopBackIndicator = Format & CAN_LLC_FORMAT_LBF;

