espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/src/py32f07x_hal_can.c
    if (pRxHeader->IdType == CAN_EXTENDED_ID)
    {
      pRxHeader->Identifier = hcan->Instance->RBUF.ID & CAN_LLC_EXTENDED_ID_MSK;
    }
    else
    {
      pRxHeader->Identifier = (hcan->Instance->RBUF.ID & CAN_LLC_STANDARD_ID_MSK) >> 18;
    }
    
    /* Retrieve Rx payload */
    pData = (uint8_t *)hcan->Instance->RBUF.DATA;
    for (ByteCounter = 0; ByteCounter < DLCtoBytes[pRxHeader->DataLength]; ByteCounter++)
    {
      pRxData[ByteCounter] = pData[ByteCounter];
    }
    
    /* The host controller has read the actual RB slot and releases it. Afterwards CAN-CTRL points
          to the next RB slot.*/
    SET_BIT(hcan->Instance->MCR, CAN_MCR_RREL);
    
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Abort the message is sent from Tx FIFO to the bus
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  transmitType Select a send mode to abort
  *         This parameter can be a value of @arg CAN_transmit_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_AbortTxRequest(CAN_HandleTypeDef *hcan, uint32_t TransmitType)
{
  /* Check function parameters */
  assert_param(IS_CAN_TRANSMIT_MODE(TransmitType));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (TransmitType == CAN_TXFIFO_PTB_SEND)
    {
      /* Abort PTB FIFO data transmission */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TPA);
    }

    if ((TransmitType == CAN_TXFIFO_STB_SEND_ONE) || (TransmitType == CAN_TXFIFO_STB_SEND_ALL))
    {
      /* Abort STB FIFO data transmission */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSA);
    }

    hcan->LastAbortTxType = TransmitType;

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config CAN Re-arbitration limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  reaLimit indicates Re-arbitration limit value.
  *         This parameter can be a value of @arg CAN_rearbitration_Limit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRearbitrationLimit(CAN_HandleTypeDef *hcan, uint32_t reaLimit)
{
  /* Check function parameters */
  assert_param(IS_CAN_REARBITRATION_LIMIT(reaLimit));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {

    MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_REALIM, reaLimit);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config CAN Re-transmission limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  retLimit indicates Re-transmission limit value.
  *         This parameter can be a value of @arg CAN_retransmission_Limit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRetransmissionLimit(CAN_HandleTypeDef *hcan, uint32_t retLimit)
{
  /* Check function parameters */
  assert_param(IS_CAN_RETRANSMISSION_LIMIT(retLimit));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_RETLIM, retLimit);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config the Priority mode of STB Buffer transmit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  stbPriority the Priority mode of STB Buffer transmit.
  *         This parameter can be a value of @arg CAN_STB_Priority_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigTxFifoPriority(CAN_HandleTypeDef *hcan, uint32_t StbPriority)
{
  /* Check function parameters */
  assert_param(IS_CAN_STB_PRIORITY(StbPriority));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_TSMODE, StbPriority);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Configure the STB FIFO operation mode.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  OperationMode operation mode.
  *         This parameter can be a value of @arg CAN_RX_FIFO_overflow_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoOverwrite(CAN_HandleTypeDef *hcan, uint32_t OverflowMode)
{
  /* Check function parameters */
  assert_param(IS_CAN_RX_FIFO_MODE(OverflowMode));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_ROM, OverflowMode);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Configure receive buffer almost full warning limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  threshold receive buffer almost full warning limit.
  *         This parameter can be a value of @arg CAN_RX_FIFO_threshold.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoThreshold(CAN_HandleTypeDef *hcan, uint32_t Threshold)
{
  /* Check function parameters */
  assert_param(IS_CAN_RX_FIFO_THRESHOLD(Threshold));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->WECR, CAN_WECR_AFWL, Threshold);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_EnableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    /* Enable transmitter delay compensation */
    SET_BIT(hcan->Instance->MCR, CAN_MCR_RBALL);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Disable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_DisableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    /* Enable transmitter delay compensation */
    CLEAR_BIT(hcan->Instance->MCR, CAN_MCR_RBALL);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pTTConfig pointer to an CAN_TimeTriggerTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_TT_Config(CAN_HandleTypeDef *hcan, CAN_TimeTriggerTypeDef *pTTConfig)
{
  /* Check function parameters */
  assert_param(IS_CAN_TT_FIFO_MODE(pTTConfig->FifoMode));
  assert_param(IS_CAN_TT_PRESCALER(pTTConfig->Prescaler));
  if (pTTConfig->RefMessageIdType == CAN_STANDARD_ID)
  {
    assert_param(IS_CAN_MAX_VALUE(pTTConfig->RefMessageId, 0x7FFU));
  }
  else /* pTxHeader->IdType == CAN_EXTENDED_ID */
  {
    assert_param(IS_CAN_MAX_VALUE(pTTConfig->RefMessageId, 0x1FFFFFFFU));
  }
  assert_param(IS_CAN_TX_ENABLE_WINDOW(pTTConfig->TxEnableWindow));
  assert_param(IS_CAN_WATCH_TRIG_TIME(pTTConfig->WatchTrigTime));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_TTTBM, pTTConfig->FifoMode);

