espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/src/py32f07x_hal_can.c
    if (pTTConfig->RefMessageIdType == CAN_STANDARD_ID)
    {
      WRITE_REG(hcan->Instance->REFMSG, (pTTConfig->RefMessageId));
    }
    else
    {
      WRITE_REG(hcan->Instance->REFMSG, (0x80000000 | pTTConfig->RefMessageId));
    }

    MODIFY_REG(hcan->Instance->TTTR, CAN_TTTR_TT_WTRIG,(pTTConfig->WatchTrigTime<<CAN_TTTR_TT_WTRIG_Pos));

    MODIFY_REG(hcan->Instance->TTCR, (CAN_TTCR_T_PRESC | CAN_TTCR_TEW), (pTTConfig->Prescaler | (pTTConfig->TxEnableWindow << CAN_TTCR_TEW_Pos)));

    SET_BIT(hcan->Instance->TTCR, CAN_TTCR_TTEN);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Add a message to the time trig FIFO
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  txheader pointer to an CAN_TxHeaderTypeDef structure.
  * @param  pData pointer to a buffer containing the payload of the Tx frame.
  * @param  slotIndex the fifo index
  *         This parameter can be a value of @arg CAN_TT_FIFO_INDEX.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_TT_AddMessageToFifo(CAN_HandleTypeDef *hcan, CAN_TxHeaderTypeDef *txHeader, uint8_t *pData, uint32_t slotIndex)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->TTCR, CAN_TTCR_TBPTR, (slotIndex<<CAN_TTCR_TBPTR_Pos));

    if (READ_BIT(hcan->Instance->MCR, CAN_MCR_TSFF) == 0)
    {
      /* Write data to the FIFO */
      CAN_CopyMessageToFifo(hcan, txHeader, pData);

      /* Notifies CAN that the slot is filled */
      SET_BIT(hcan->Instance->TTCR, CAN_TTCR_TBF);
    }
    else
    {
      /* Update error code */
      hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

      return HAL_ERROR;
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Activate TTCAN Trigger Request.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  triggerType TTCAN trigger type.
  *         This parameter can be a value of @arg CAN_TT_trigger_type.
  * @param  trigTime TTCAN trigger time.
  * @param  slotIndex the fifo index
  *         This parameter can be a value of @arg CAN_TT_FIFO_INDEX.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_TT_ActivateTrigRequest(CAN_HandleTypeDef *hcan, uint32_t triggerType, uint32_t trigTime, uint32_t slotIndex)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->TTCR, (CAN_TTCR_TTPTR | CAN_TTCR_TTYPE), ((slotIndex<<CAN_TTCR_TTPTR_Pos) | triggerType));

    MODIFY_REG(hcan->Instance->TTTR, CAN_TTTR_TT_TRIG, (trigTime<<CAN_TTTR_TT_TRIG_Pos));

    hcan->LastTimeTrigType = triggerType;

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  TTCAN mode,set TB slot to empty.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  slotIndex TB SLOT index.
  *         This parameter can be a value of @arg CAN_TT_FIFO_INDEX.
  * @param  slotState Set TB SLOT state
  *         This parameter can be a value of @arg CAN_TT_FIFO_State_Set.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_TT_ConfigTxBufferState(CAN_HandleTypeDef *hcan, uint32_t slotIndex, uint32_t slotState)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->TTCR, CAN_TTCR_TBPTR, (slotIndex<<CAN_TTCR_TBPTR_Pos));

    MODIFY_REG(hcan->Instance->TTCR, (CAN_TTCR_TBE | CAN_TTCR_TBF), slotState);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Start the CAN module.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_Start(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

  if (hcan->State == HAL_CAN_STATE_READY)
  {
    /* Change CAN peripheral state */
    hcan->State = HAL_CAN_STATE_BUSY;

    /* Request leave initialisation */
    CLEAR_BIT(hcan->Instance->MCR, CAN_MCR_RESET);

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Wait until the RESET bit into MCR register is set */
    while ((hcan->Instance->MCR & CAN_MCR_RESET) != 0)
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcan->ErrorCode |= HAL_CAN_ERROR_TIMEOUT;

        /* Change CAN state */
        hcan->State = HAL_CAN_STATE_ERROR;

        return HAL_ERROR;
      }
    }
    
    /* Specifies the CAN working mode */
    if (hcan->Init.Mode == CAN_MODE_RESTRICTED_OPERATION)
    {
      SET_BIT(hcan->Instance->TSNCR, CAN_TSNCR_ROP);
    }
    else
    {
      MODIFY_REG(hcan->Instance->MCR, (CAN_MCR_LBME | CAN_MCR_LBMI | CAN_MCR_SACK | CAN_MCR_LOM), \
                 hcan->Init.Mode);
    }

    /* Reset the CAN ErrorCode */
    hcan->ErrorCode = HAL_CAN_ERROR_NONE;

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_READY;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable interrupts.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  ActiveITs indicates which interrupts will be enabled.
  *         This parameter can be any combination of @arg CAN_Interrupts.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ActivateNotification(CAN_HandleTypeDef *hcan, uint32_t activeITs)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    __HAL_CAN_ENABLE_IT(hcan, activeITs);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Disable interrupts.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  InactiveITs indicates which interrupts will be disabled.
  *         This parameter can be any combination of @arg CAN_Interrupts.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_DeactivateNotification(CAN_HandleTypeDef *hcan, uint32_t inactiveITs)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    __HAL_CAN_DISABLE_IT(hcan, inactiveITs);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  CAN enter standby mode.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_EnterStandbyMode(CAN_HandleTypeDef *hcan)
{
  uint32_t tickstart;

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    SET_BIT(hcan->Instance->MCR, CAN_MCR_STBY);

    /* Get tick */
    tickstart = HAL_GetTick();

    while (READ_BIT(hcan->Instance->MCR, CAN_MCR_STBY) == 0)
    {
      /* Check for the Timeout */
      if ((HAL_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
      {
        /* Update error code */
        hcan->ErrorCode |= HAL_CAN_ERROR_TIMEOUT;
        
        return HAL_ERROR;
      }
      SET_BIT(hcan->Instance->MCR, CAN_MCR_STBY);
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  CAN exit standby mode.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ExitStandbyMode(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    CLEAR_BIT(hcan->Instance->MCR, CAN_MCR_STBY);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Get protocol status.
  * @param  hfdcan pointer to an FDCAN_HandleTypeDef structure that contains
  *         the configuration information for the specified FDCAN.
  * @param  ProtocolStatus pointer to an FDCAN_ProtocolStatusTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_GetProtocolStatus(CAN_HandleTypeDef *hcan, CAN_ProtocolStatusTypeDef *ProtocolStatus)
{
  uint32_t StatusReg;

  /* Read the protocol status register */
  StatusReg = READ_REG(hcan->Instance->WECR);

