espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/src/py32f07x_hal_can.c
  /* Watch Trigger Interrupt */
  if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TIMESTAMP_WRAPAROUND) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_TIMESTAMP_WRAPAROUND) != 0U))
  {
    /* Clear the Timestamp Wraparound flag */
    __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TIMESTAMP_WRAPAROUND);
#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
    /* Call registered callback*/
    hcan->TimestampWraparoundCallback(hcan);
#else
    /* Timestamp Wraparound Callback */
    HAL_CAN_TT_TimestampWraparoundCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
  }

  /* Error interrupt */
  if (((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_ALL_ERROR) != 0U) && \
      (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_ALL_ERROR) != 0U)) ||\
      (__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TRIGGER_ERROR) != 0U))
  {
    /* interrupt of Overflow of CAN Rx FIFO */
    if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_RX_FIFO_OVERFLOW) != 0U) && \
        (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_RX_FIFO_OVERFLOW) != 0U))
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_RX_FIFO_OVERFLOW);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->RxFifoOverflowCallback(hcan);
#else
      /* Receive fifo overflow Callback */
      HAL_CAN_RxFifoOverflowCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }

    /* Arbitration lost interrupt*/
    if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_ARB_LOST) != 0U) && \
        (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_ARB_LOST) != 0U))
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_ARB_LOST);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->ArbitrationLostCallback(hcan);
#else
      /* Arbitration lost Callback */
      HAL_CAN_ArbitrationLostCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }

    /* Error_Passive interrupt*/
    if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_ERROR_PASSIVE) != 0U) && \
        (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_ERROR_PASSIVE) != 0U))
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_ERROR_PASSIVE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->PassiveErrorCallback(hcan);
#else
      /* Passive error Callback */
      HAL_CAN_PassiveErrorCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }

    /* bus error interrupt */
    if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_BUS_ERROR) != 0U) && \
        (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_BUS_ERROR) != 0U))
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_BUS_ERROR);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->BusErrorCallback(hcan);
#else
      /* Bus error Callback */
      HAL_CAN_BusErrorCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }

    /* interrupt of Bus_Off status changed or Error_Passive status changed */
    if ((__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_ERROR_TOGGLE) != 0U) && \
        (__HAL_CAN_GET_IT_SOURCE(hcan, CAN_IT_ERROR_TOGGLE) != 0U))
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_ERROR_TOGGLE);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->ErrorChangeCallback(hcan);
#else
      /* Error change Callback */
      HAL_CAN_ErrorChangeCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }

    /* Trigger error Interrupt */
    if (__HAL_CAN_GET_FLAG(hcan, CAN_FLAG_TRIGGER_ERROR) != 0U)
    {
      __HAL_CAN_CLEAR_FLAG(hcan, CAN_FLAG_TRIGGER_ERROR);

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
      /* Call registered callback*/
      hcan->TT_TrigErrorCallback(hcan);
#else
      /* TTCAN trig error Callback */
      HAL_CAN_TT_TrigErrorCallback(hcan);
#endif /* USE_HAL_CAN_REGISTER_CALLBACKS */
    }
  }
}

#if USE_HAL_CAN_REGISTER_CALLBACKS == 1
/**
  * @brief  Register a CAN CallBack.
  *         To be used instead of the weak predefined callback
  * @param  hcan pointer to a CAN_HandleTypeDef structure that contains
  *         the configuration information for CAN module
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_CAN_RX_COMPLETE_CB_ID             CAN Rx complete callback ID
  *           @arg @ref HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID     CAN Rx fifo almost full callback ID 
  *           @arg @ref HAL_CAN_RX_FIFO_FULL_CB_ID            CAN Rx fifo full callback ID 
  *           @arg @ref HAL_CAN_PTB_TX_COMPLETE_CB_ID         CAN PTB Tx complete callback ID 
  *           @arg @ref HAL_CAN_STB_TX_COMPLETE_CB_ID         CAN STB Tx complete callback ID
  *           @arg @ref HAL_CAN_TX_ABORT_CB_ID                CAN Tx abort callback ID         
  *           @arg @ref HAL_CAN_RX_FIFO_OVERFLOW_CB_ID        CAN Rx fifo overflow callback ID 
  *           @arg @ref HAL_CAN_ARBITRATION_LOST_CB_ID        CAN Arbitration lost callback ID 
  *           @arg @ref HAL_CAN_PASSIVE_ERROR_CB_ID           CAN Passive error callback ID
  *           @arg @ref HAL_CAN_BUS_ERROR_CB_ID               CAN Bus error callback ID 
  *           @arg @ref HAL_CAN_ERROR_CHANGE_CB_ID            CAN Error change callback ID 
  *           @arg @ref HAL_CAN_TT_RX_TIME_TRIG_CB_ID         CAN TT Rx time trig callback ID
  *           @arg @ref HAL_CAN_TT_TX_SINGLE_TRIG_CB_ID       CAN TT Tx single trig callback ID
  *           @arg @ref HAL_CAN_TT_TX_START_TRIG_CB_ID        CAN TT Tx start trig callback ID 
  *           @arg @ref HAL_CAN_TT_TX_STOP_TRIG_CB_ID         CAN TT Tx stop trig callback ID
  *           @arg @ref HAL_CAN_TT_TIMESTAMP_WRAPAROUND_CB_ID CAN TT timestamp wraparound callback ID
  *           @arg @ref HAL_CAN_TT_TRIG_ERROR_CB_ID           CAN TT trig error callback ID
  *           @arg @ref HAL_CAN_MSPINIT_CB_ID                 MspInit callback ID
  *           @arg @ref HAL_CAN_MSPDEINIT_CB_ID               MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_RegisterCallback(CAN_HandleTypeDef *hcan, HAL_CAN_CallbackIDTypeDef CallbackID, void (* pCallback)(CAN_HandleTypeDef *_hCAN))
{
  HAL_StatusTypeDef status = HAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }

  if (hcan->State == HAL_CAN_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_CAN_RX_COMPLETE_CB_ID :
        hfdcan->RxCpltCallback = pCallback;
        break;

      case HAL_CAN_RX_FIFO_ALMOST_FULL_CB_ID :
        hfdcan->RxFifoAlmostFullCallback = pCallback;
        break;

      case HAL_CAN_RX_FIFO_FULL_CB_ID :
        hfdcan->RxFifoFullCallback = pCallback;
        break;

